package org.wxl.wordTraining.constant;

/**
 * 文章常量
 * @author wxl
 */
public interface ArticleConstant {
    //  --------------------------------------------------  状态 -----------------------------
    /**
     * 正常发布
     */
    int NORMAL_RELEASE = 0;
    /**
     * 审核中
     */
    int  PROCESS = 1;
    /**
     * 整改中
     */
    int RECTIFICATION = 2;

    /**
     * 草稿
     */
    int DRAFT = 3;
    /**
     * 已封禁
     */
    int BAN = 4;

    //  --------------------------------------------------  权限 -----------------------------
    /**
     * 公开
     */
    int OPEN = 0;
    /**
     * 私有
     */
    int PRIVATE = 1;
    /**
     * 仅关注自己的用户
     */
    int REGARD_BY_MYSELF  = 2;


    //----------------------------------------------分页----------------------------------------
    /**
     * 分页每页页数
     */
    int MIN_CURRENT = 5;


    //---------------------------------------------文章状态--------------------------------------
    /**
     * 推荐
     */
    int RECOMMEND = 0;

    /**
     * 最新
     */
    int UP_TO_DATE = 1;

    /**
     * 最热
     */
    int HOTTEST = 2;

    String CONTENT = "<p><br></p>";

}
